{
  "ContactUsPage": {
    "title": "Kontaktiere Mythoria",
    "intro": "Grüße, Mitabenteurer! Ob du aus dem Auenland, Hogwarts oder einer weit, weit entfernten Galaxie kommst – wir sind hier, um dich auf deiner Reise durch die wunderbare Welt von Mythoria zu unterstützen. Dein Feedback ist so wertvoll wie der Eine Ring (aber deutlich einfacher zu handhaben, versprochen!).",
    "scrollTitle": "Schick uns deine Eule (oder füll einfach das Formular aus)",
    "scrollIntro": "Wähle die Schriftrolle, die am besten zu deinem Anliegen passt:",
    "categories": {
      "featureIdeas": "Feature-Ideen (Inspiriere uns wie Tolkien)",
      "reportBug": "Fehler melden (Selbst Sherlock Holmes brauchte Hinweise!)",
      "delivery": "Lieferung gedruckter Bücher (Unsere Eulen brauchen manchmal eine Wegbeschreibung)",
      "credits": "Credits & Zahlungen (Die Kobolde von Gringotts sind streng!)",
      "general": "Allgemeine Verzauberung (Support)",
      "businessPartnership": "Geschäftspartnerschaft"
    },
    "categoriesShort": {
      "featureIdeas": "Feature-Ideen",
      "reportBug": "Fehler melden",
      "delivery": "Lieferung gedruckter Bücher",
      "credits": "Credits & Zahlungen",
      "businessPartnership": "Geschäftspartnerschaft",
      "general": "Allgemeine Verzauberung"
    },
    "form": {
      "title": "Das magische Formular",
      "name": "Dein Name:",
      "namePlaceholder": "Zauberer-Alias",
      "email": "Deine E-Mail:",
      "emailPlaceholder": "Damit unsere Brieftauben dich finden können",
      "category": "Wähle dein Anliegen:",
      "selectCategory": "Kategorie auswählen...",
      "message": "Deine magische Nachricht:",
      "messagePlaceholder": "Teile deine Gedanken, Ideen oder magisches Feedback...",
      "submit": "Zauber wirken"
    },
    "join": {
      "title": "Tritt der Gemeinschaft bei",
      "intro": "Mythoria ist auf einer epischen Quest, neue Welten zu erobern, und wir suchen mutige Seelen, die sich unserer Gemeinschaft anschließen!",
      "printing": "Druck- & Logistikpartner: Bist du bereit, durch Mittelerde oder Westeros zu reisen, um Geschichten zu liefern, die zählen? Schließ dich uns an und verbreite die Magie personalisierter Geschichten.",
      "country": "Ländervertreter & lokale Zauberer: Hilf Mythoria, die Welt zu erobern (friedlich, versprochen). Bring die Freude am Geschichtenerzählen in dein Königreich und darüber hinaus!",
      "developers": "Entwickler, die Code vibes und mit KI plaudern: Sprichst du fließend Binär und chattest mühelos mit KI? Wir brauchen talentierte Entwickler, die innovative Technologie und künstliche Intelligenz draufhaben, um das Mythoria-Erlebnis zu verbessern.",
      "call": "Interesse, ein Mythorian zu werden? Schick uns deine Details über das verzauberte Formular oben und lass uns wissen, wofür du dich interessierst."
    },
    "bonus": {
      "title": "Bonus-Credits Alarm!",
      "content": "Hast du ein scharfes Auge für Bugs oder einen fantasievollen Kopf voller Ideen? Verdiene extra magische Credits für jeden gemeldeten Bug oder jede inspirierende Feature-Idee.",
      "disclaimer": "(*) Die finale Entscheidung liegt bei unseren bezaubernden Oompa Loompas. Sie sind charmant unberechenbar, aber sie lieben es, Kreativität zu belohnen!",
      "closing": "Lass uns zusammen Magie erschaffen!"
    }
  }
}
