{
  "RevolutPayment": {
    "loading": "Cargando opciones de pago...",
    "securityNote": "Tu información de pago está segura y cifrada.",
    "encryptionNote": "Protegido con cifrado SSL de 256 bits",
    "errors": {
      "sdkLoadFailed": "No se pudo cargar el sistema de pagos. Por favor, recarga la página.",
      "initializationFailed": "No se pudo inicializar el pago. Inténtalo de nuevo.",
      "3ds_challenge_failed_manually": "El desafío 3‑D Secure ha fallado. Inténtalo de nuevo o usa otro método de pago.",
      "insufficient_funds": "Fondos insuficientes. Recarga tu cuenta o usa otra tarjeta.",
      "transaction_not_allowed_for_cardholder": "Esta transacción no está permitida para tu tarjeta.",
      "high_risk": "Pago marcado como de alto riesgo. Ponte en contacto con soporte o usa otra tarjeta.",
      "cardholder_name_missing": "Falta el nombre del titular. Introduce el nombre completo tal y como aparece en la tarjeta.",
      "unknown_card": "No se ha podido reconocer la tarjeta. Comprueba los datos o usa otra tarjeta.",
      "customer_challenge_abandoned": "Has abandonado el desafío de seguridad. Inténtalo otra vez.",
      "customer_challenge_failed": "El desafío de seguridad ha fallado. Inténtalo de nuevo.",
      "customer_name_mismatch": "El nombre de la tarjeta no coincide con tu cuenta.",
      "do_not_honour": "El emisor ha rechazado el pago. Contacta con tu banco o usa otra tarjeta.",
      "expired_card": "La tarjeta ha caducado. Usa una tarjeta válida.",
      "invalid_address": "Dirección de facturación no válida. Comprueba y vuelve a intentarlo.",
      "invalid_amount": "Importe de pago no válido. Recarga e inténtalo de nuevo.",
      "invalid_card": "Número de tarjeta no válido. Revisa tus datos.",
      "invalid_email": "Correo electrónico no válido. Corrige e inténtalo de nuevo.",
      "invalid_country": "No se admiten pagos desde este país.",
      "invalid_cvv": "Código de seguridad no válido. Comprueba e inténtalo otra vez.",
      "invalid_expiry": "Fecha de caducidad no válida. Corrige e inténtalo de nuevo.",
      "invalid_merchant": "Comercio no válido. Contacta con soporte.",
      "invalid_phone": "Número de teléfono no válido. Corrige e inténtalo.",
      "invalid_pin": "PIN no válido. Inténtalo otra vez.",
      "issuer_not_available": "El emisor de la tarjeta no está disponible. Prueba más tarde.",
      "pick_up_card": "Tarjeta denunciada como perdida o robada. Contacta con tu banco.",
      "rejected_by_customer": "Pago cancelado por el titular de la tarjeta.",
      "restricted_card": "Esta tarjeta está restringida y no puede usarse.",
      "technical_error": "Ha ocurrido un error técnico. Inténtalo más tarde.",
      "withdrawal_limit_exceeded": "Límite de retirada de la tarjeta superado.",
      "issuer_decline": "El emisor de la tarjeta ha rechazado el pago.",
      "suspected_fraud": "Pago rechazado por posible fraude.",
      "lost_card": "Tarjeta denunciada como perdida. Usa otra tarjeta.",
      "stolen_card": "Tarjeta denunciada como robada. Usa otra tarjeta.",
      "security_violation": "Pago rechazado por violación de seguridad.",
      "law_violation": "Pago rechazado por restricciones legales.",
      "transaction_not_allowed": "Esta transacción no está permitida.",
      "authentication_required": "Se requiere autenticación. Completa la verificación adicional.",
      "invalid_account": "Cuenta no válida. Consulta con tu banco.",
      "invalid_transaction": "Transacción no válida. Inténtalo otra vez.",
      "no_such_issuer": "El emisor de la tarjeta no existe.",
      "currency_not_supported": "La moneda no es compatible con esta tarjeta.",
      "new_card_not_unblocked": "La tarjeta nueva aún no está activada. Contacta con tu banco.",
      "withdrawal_frequency_exceeded": "Se ha superado la frecuencia de retirada.",
      "pin_try_exceeded": "Demasiados intentos de PIN incorrectos.",
      "pin_required": "Se requiere PIN para completar la transacción.",
      "customer_verification_failed": "La verificación del cliente ha fallado.",
      "card_not_enrolled_to_three_ds": "La tarjeta no está inscrita en 3‑D Secure.",
      "no_common_supported_three_ds_version": "Versión de 3‑D Secure no compatible.",
      "payment_attempt_blocked": "Intento de pago bloqueado por motivos de seguridad.",
      "unknown": "Error desconocido. Inténtalo de nuevo."
    }
  }
}
