{
  "StorySteps": {
    "common": {
      "stepProgress": "Paso {currentStep} de {totalSteps}",
      "saving": "Guardando..."
    },
    "step1": {
      "unauthenticated": {
        "title": "¡Vaya! Parece que intentas colarte en la sala de autores!",
        "description": "Agradecemos tu entusiasmo por contar historias, pero primero tendrás que iniciar sesión. Tranquilo, es más fácil que convencer a un dragón para que comparta su tesoro. 🐉",
        "signIn": "🔐 Inicia sesión para comenzar",
        "signUp": "✨ Crea tu cuenta de autor"
      },
      "heading": "Capítulo 1 - El autor",
      "intro": "¡Bienvenido, cuentacuentos! Antes de lanzarnos a tu aventura mágica, vamos a configurar la información del autor de tu historia. Puedes usar tu propio nombre o inventar uno para esta narración.",
      "fields": {
        "authorName": "Nombre(s) del autor *",
        "authorNameHelp": "¿Quién debe aparecer como autor de esta historia?",
        "authorNamePlaceholder": "p. ej., Andrés y Matilde",
        "dedication": "Mensaje de dedicatoria",
        "dedicationPlaceholder": "Escribe un mensaje de dedicatoria para la primera página de tu libro...",
        "dedicationHelp": "Este mensaje aparecerá en la primera página de tu historia",
        "optional": "Opcional"
      },
      "messages": {
        "loadingProfile": "Cargando tu perfil de autor...",
        "required": "Por favor, indica un nombre de autor para tu historia",
        "saveFailed": "No se pudo guardar la información del autor. Inténtalo de nuevo.",
        "fetchFailed": "No se pudieron obtener los datos del usuario",
        "loadFailed": "No se pudo cargar la información del usuario. Inténtalo de nuevo."
      }
    },
    "step2": {
      "heading": "Capítulo 2 - La historia",
      "intro": "Puedes crear tu historia dibujándola, grabándola o simplemente escribiéndola.",
      "tellYourStoryLabel": "Cuenta tu historia...",
      "textPlaceholder": "Érase una vez... ¡Deja volar tu imaginación! Comparte tu aventura, tus sueños o cualquier historia que te salga del corazón.",
      "textHelp": "Escribe todo lo que quieras. Siempre podrás editarlo más tarde.",
      "tabWrite": "Escribir",
      "tabImage": "Imagen",
      "tabRecord": "Grabar",
      "takePhoto": "Tomar foto",
      "uploadImage": "Subir imagen",
      "recordVoice": "Graba tu voz",
      "uploadAudio": "Subir archivo de audio",
      "imageHelp": "Dibuja tu historia, hazle una foto o sube una imagen que la cuente.",
      "audioHelp": "Graba tu historia directamente o sube un archivo de audio. Perfecto para quienes prefieren contarla de viva voz.",
      "recordingHelp": "¡Cuéntanos tu historia! Habla claro al micrófono.",
      "reassurance": "Si has escrito texto o subido una imagen arriba, nuestros Oompa-Loompas se esforzarán para extraer personajes, escenarios y temas. Si no, los siguientes pasos te guiarán para crear tu historia paso a paso.",
      "processing": "Procesando con IA...",
      "next": "Siguiente",
      "buttons": {
        "capture": "📸 Capturar",
        "cancel": "❌ Cancelar"
      },
      "writingTips": [
        {
          "text": "¿Dónde transcurre tu historia? Describe el mundo: ¿es un reino mágico, un pueblo acogedor o algo más allá de la imaginación?"
        },
        {
          "text": "¿Quiénes son los personajes principales? ¿Qué les hace especiales o únicos? ¿Cuáles son sus sueños y miedos?"
        },
        {
          "text": "Esboza el argumento básico de tu historia."
        },
        {
          "text": "Escribe lo que te salga del corazón."
        },
        {
          "text": "¡Habla de un recuerdo de la infancia o de un evento que esté por venir!"
        },
        {
          "text": "¿Qué quieren conseguir tus personajes? Dales una meta clara a la que apuntar."
        },
        {
          "text": "¿Qué hace única tu historia? ¡Añade elementos especiales que solo existan en tu mundo!"
        }
      ],
      "badgeLabels": {
        "added": "Añadido",
        "image": "imagen",
        "images": "imágenes"
      },
      "imageGalleryTitle": "Tus imágenes ({count}/3)",
      "photoTips": {
        "title": "📸 Consejos para fotos",
        "tips": [
          "Haz fotos de dibujos, escenas o notas escritas",
          "Puedes añadir hasta 3 imágenes para contar tu historia",
          "Nuestra IA analizará las imágenes para ayudarte a crear la historia",
          "Mezcla fotos con texto o audio para una historia más rica"
        ]
      },
      "recordingTips": {
        "title": "Consejos para grabar",
        "tips": [
          "Habla con claridad y a un ritmo cómodo",
          "Describe tu historia como si se la contases a un colega",
          "Incluye detalles sobre personajes, escenarios y eventos",
          "No te agobies con la perfección, ¡solo cuéntala!"
        ]
      },
      "writingTipsTitle": "Consejos de escritura",
      "actions": {
        "done": "Hecho",
        "remove": "Eliminar",
        "recordAgain": "Grabar de nuevo",
        "stopRecording": "Detener grabación",
        "recording": "Grabando..."
      },
      "audioSupport": {
        "notSupported": "Tu navegador no soporta el elemento de audio."
      },
      "alerts": {
        "uploadError": "No se pudo subir el archivo. Inténtalo de nuevo.",
        "recordingError": "No se pudo iniciar la grabación. Revisa los permisos del micrófono.",
        "processingError": "No se pudo procesar tu historia. Inténtalo de nuevo.",
        "cameraPermissionError": "Permiso de cámara denegado. Permite el acceso para poder hacer fotos.",
        "microphonePermissionError": "Permiso de micrófono denegado. Permite el acceso para grabar audio.",
        "analyzeImageRequest": "Analiza la imagen y describe lo que ves...",
        "genAIError": "La solicitud a GenAI ha fallado. Inténtalo otra vez.",
        "cameraIssue": "Problema de acceso a la cámara. Revisa los permisos.",
        "microphoneIssue": "Problema de acceso al micrófono. Revisa los permisos.",
        "failedToCreateStory": "No se pudo crear la historia: {errorMessage}. Inténtalo de nuevo."
      },
      "loadingModal": {
        "title": "✨ Creando tu historia",
        "message": "¡Nuestros Oompa Loompas mágicos están manos a la obra preparando tu historia! Esto puede tardar un pelín...",
        "pleaseWait": "Por favor, espera mientras hacemos nuestra magia. ✨"
      },
      "errors": {
        "failedGetUser": "No se pudo obtener la información del usuario.",
        "failedCreate": "No se pudo crear la historia.",
        "unknown": "Ha ocurrido un error desconocido."
      },
      "characterSelection": {
        "includeExistingTitle": "Incluir tus personajes existentes",
        "noneSelected": "Selecciona personajes para incluir en tu historia",
        "selectedCount": "{count, plural, =1 {# personaje seleccionado} other {# personajes seleccionados}}",
        "selectAll": "Seleccionar todos ({count} personajes)",
        "loading": "Cargando personajes..."
      }
    },
    "step3": {
      "heading": "Capítulo 3 - Los personajes",
      "intro": "¿Quiénes son los héroes, amigos y criaturas mágicas de tu historia? Crea personajes que den vida a tu aventura.",
      "addCharacter": "➕ Añadir personaje",
      "chooseMethod": "Elige cómo añadir un personaje:",
      "createNew": "✨ Crear personaje nuevo",
      "useExisting": "📚 Usar personaje existente",
      "orChooseExisting": "O elige entre tus personajes existentes:",
      "cancel": "Cancelar",
      "loadingCharacters": "Cargando tus personajes...",
      "readyTitle": "¿Listo para conocer a tus personajes?",
      "readyDescription": "¡Toda gran historia necesita personajes increíbles! Pulsa \"Añadir personaje\" para crear nuevos héroes o añadir los que ya tengas a esta historia.",
      "greatWork": "¡Buen trabajo! Has creado {count, plural, =1 {# personaje} other {# personajes}}.",
      "youCanAlways": "Siempre podrás añadir más personajes más adelante o pasar al siguiente capítulo para seguir desarrollando tu historia.",
      "continuing": "Continuando...",
      "progress": {
        "stepLabel": "Paso {currentStep} de {totalSteps}"
      },
      "badges": {
        "editingDraft": "Editando borrador"
      },
      "navigation": {
        "backToMyStories": "Volver a mis historias"
      },
      "alerts": {
        "failedToLoadStoryCharacters": "No se pudieron cargar los personajes de la historia. Inténtalo de nuevo.",
        "characterLoadError": "Error al cargar los personajes. Recarga la página.",
        "failedToLoadStoryData": "No se pudieron cargar los datos de la historia. Inténtalo de nuevo.",
        "failedToLoadStoryForEditing": "No se pudo cargar la historia para editarla. Inténtalo de nuevo.",
        "failedToAddCharacter": "No se pudo añadir el personaje a la historia. Inténtalo de nuevo.",
        "failedToContinue": "No se pudo continuar. Inténtalo de nuevo."
      },
      "next": "Siguiente"
    },
    "step4": {
      "heading": "Capítulo 4 - La trama",
      "intro": "Ahora definamos los elementos clave de tu historia. Cuéntanos sobre el mundo que quieres crear, para quién escribes y cómo imaginas que se vea.",
      "fields": {
        "title": "Título del libro *",
        "titleHelp": "Elige un título que enganche para tu historia",
        "place": "Escenario/Lugar",
        "placeHelp": "¿Dónde transcurre tu historia? (real o imaginario)",
        "audience": "Público objetivo",
        "audienceHelp": "¿Para quién está escrita esta historia?",
        "novelStyle": "Estilo de novela",
        "novelStyleHelp": "¿Qué género/estilo quieres para tu historia?",
        "graphicStyle": "Estilo gráfico",
        "graphicStyleHelp": "Elige el estilo artístico para las ilustraciones de tu historia",
        "literaryPersona": "Persona Narrativa",
        "literaryPersonaHelp": "Elige la vibra de narrador que quieres que la IA imite.",
        "imageInstructions": "Instrucciones personalizadas para las imágenes",
        "imageInstructionsHelp": "Da instrucciones específicas para personalizar las imágenes generadas por la IA. Describe la apariencia de los personajes, preferencias de estilo visual o cualquier elemento especial que quieras incluir.",
        "bookSize": "Tamaño del libro",
        "bookSizeHelp": "Número de capítulos/párrafos de tu historia",
        "storyLanguage": "Idioma de la historia",
        "storyLanguageHelp": "El idioma en que se generará tu historia. Se ha detectado a partir de tu entrada, pero puedes cambiarlo aquí.",
        "outline": "Esquema de la historia",
        "outlineHelp": "Describe la trama, los personajes y los eventos clave de tu historia",
        "additional": "Peticiones adicionales",
        "additionalHelp": "Cualquier petición especial o elementos específicos que quieras incluir"
      },
      "placeholders": {
        "selectAudience": "Selecciona el público objetivo...",
        "selectNovelStyle": "Selecciona el estilo de novela...",
        "selectGraphicStyle": "Selecciona el estilo gráfico...",
        "selectLiteraryPersona": "Selecciona una persona literaria...",
        "imageInstructions": "Describe cómo quieres que se vean los personajes, elementos visuales, colores o detalles artísticos de las imágenes de tu historia...",
        "outlinePlaceholder": "Describe todos los detalles que te gustaría en la historia...",
        "storyLanguageHelp": "Tu historia se escribirá y generará en el idioma seleccionado."
      },
      "literaryPersona": {
        "label": "Persona Narrativa",
        "helper": "Usamos por defecto nuestro narrador clásico equilibrado. Cambia si quieres otra vibra.",
        "placeholder": "Selecciona una persona literaria...",
        "sampleLabel": "Estilo de muestra",
        "metaLabels": {
          "pov": "POV",
          "tone": "Tono",
          "rhythm": "Ritmo",
          "vocabulary": "Vocabulario"
        },
        "metaInfo": {
          "title": "Cómo leer estas insignias",
          "description": "POV, Tono, Ritmo y Vocabulario describen cómo habla el narrador. Úsalos para elegir la voz que encaja con tu escena.",
          "trigger": "¿Qué significan?",
          "items": {
            "pov": {
              "label": "POV (Punto de vista)",
              "description": "Quién narra la historia. 1ª = yo, 2ª = tú, 3ª-limitada = ojos de un personaje, 3ª-omnisciente = todos."
            },
            "tone": {
              "label": "Tono",
              "description": "Energía emocional de tranquilo (1) a intenso (5)."
            },
            "rhythm": {
              "label": "Ritmo",
              "description": "Velocidad de las frases de lento/fluido (1) a rápido/contundente (5)."
            },
            "vocabulary": {
              "label": "Vocabulario",
              "description": "Complejidad de palabras de simple y cotidiano (1) a más rico y avanzado (5)."
            }
          }
        },
        "options": {
          "storyteller": {
            "name": "El Narrador de Historias",
            "description": "Voz cálida y empática, como un abuelo contando recuerdos; prioriza emociones y moralejas suaves.",
            "sample": "Aquella tarde de domingo, el pequeño campo junto al mar parecía un refugio seguro, cosido por el viento salado y las risas. Rodrigo puso el balón frente a John y se agachó un poco para que su voz encontrara la altura de su hermano. \"Primero, sé suave\", dijo, tocando el balón como si fuera un animalito asustadizo. John lo intentó, pero el balón se le escapó del pie. Su cara se tensó, como pasa cuando el orgullo es más grande que el error. Rodrigo sonrió suavemente. \"Es normal\", le dijo. \"Venga, otra vez\". Las olas mantenían su ritmo constante detrás, y con cada nuevo intento, el toque de John se volvía más tranquilo. Cuando el balón finalmente se quedó cerca, John levantó la vista radiante, y los ojos de Rodrigo dijeron el resto: la paciencia es amor con tiempo dentro."
          },
          "adventurous-narrator": {
            "name": "El Narrador Aventurero",
            "description": "Vuelve épicos los momentos cotidianos con energía juguetona en segunda persona y toques de fantasía.",
            "sample": "Tarde de domingo: HORA DE LA MISIÓN. Entras en el pequeño campo de fútbol cerca del océano, en el norte de Portugal, y te golpea el Jefe Viento Marino, nivel: salado. Rodrigo, el legendario entrenador y hermano mayor, deja caer el balón a los pies de John como si fuera un artefacto sagrado. \"Misión John, Fase Uno: ¡toques pequeñitos!\", dice Rodrigo. John toca el balón. El balón sale disparado como si intentara escapar a la playa. \"¡EH! ¡VUELVE!\", grita John. Rodrigo se ríe. \"Bien. Ahora persíguelo. Los héroes siempre persiguen su primer error\". Reinicias. John lo intenta de nuevo, más suave esta vez. \"¡Cabeza arriba!\", avisa Rodrigo. John mira hacia arriba y, BOOM, de repente el balón obedece. Las olas rugen de fondo como una multitud en el estadio. Nivel superado. Próxima misión: el legendario Pase del Destino."
          },
          "fun-reporter": {
            "name": "El Reportero Divertido",
            "description": "Crónica alegre y ocurrente de las andanzas del grupo, con ritmo ágil y muchas citas.",
            "sample": "16:42: Comienza el entrenamiento de domingo en un pequeño campo cerca del océano (Norte de Portugal). Parte meteorológico: el viento está a tope.\n\nRodrigo (Entrenador/Hermano Mayor) coloca el balón con la seriedad de una final de Champions. John (Becario/Hermano Menor) asiente como si firmara un contrato.\n\nCita del momento:\n- Rodrigo: \"Toques cortos. No pelees con el balón\".\n- John (tras escaparse el balón): \"¡No me escucha!\"\n\n16:45: Primer intento de regate. Resultado: el balón se libera y hace una retirada táctica hacia la brisa marina. John corre tras él con determinación máxima y coordinación media.\n\n16:49: Ajuste técnico. Rodrigo demuestra: pie relajado, cabeza arriba. John lo intenta de nuevo. Nivel de éxito: visiblemente mejor.\n\n17:03: Hito confirmado: John mantiene el balón cerca durante tres segundos enteros, lo que es básicamente una vida en términos de entrenamiento entre hermanos. Rodrigo sonríe. John lo celebra como si acabara de marcar contra el propio océano."
          },
          "friendly-educator": {
            "name": "El Educador Cercano",
            "description": "Voz suave y clara que enseña con preguntas sencillas y ejemplos.",
            "sample": "Vamos a aprender fútbol con Rodrigo y John en una tarde de domingo, cerca del océano en el norte de Portugal. ¿Oyes las olas? Ese sonido es como un metrónomo. Nos ayuda a mantener un ritmo constante.\n\nRodrigo dice: \"John, intenta un toque suave\". ¿Qué es un toque suave? Significa tocar el balón con gentileza para que se quede cerca de tus pies, como si pasearas a un perrito con correa corta.\n\nAhora inténtalo tú: cuando tocas el balón, ¿a dónde van tus ojos? ¿Abajo al balón... o arriba para ver el espacio? Rodrigo enseña: \"Mira arriba, luego toca\".\n\nMinijuego: ¿puede John dar tres toques seguidos sin perder el balón por el viento? Uno... dos... ¡uy! Se fue rodando. No pasa nada. Los errores son parte del aprendizaje.\n\nRodrigo sonríe y dice: \"Empezamos de nuevo\". John lo intenta otra vez. ¡Uno... dos... tres! ¡Genial! Eso significa que John está controlando el balón, no persiguiéndolo."
          },
          "institutional-chronicler": {
            "name": "El Cronista Institucional",
            "description": "Tono biográfico formal y preciso que mantiene los datos claros y ordenados.",
            "sample": "En una tarde de domingo, Rodrigo dirigió una sesión informal de entrenamiento de fútbol para su hermano menor, John, en un pequeño campo costero en el norte de Portugal. La actividad consistió en ejercicios introductorios de control de balón (regates cortos con fuerza reducida), prácticas de escaneo visual (orientación de la cabeza levantada antes del contacto) y ciclos repetidos de reinicio tras la pérdida de control. La sesión transcurrió bajo viento marítimo persistente, con el oleaje del océano audible en las proximidades. El entrenamiento concluyó con una mejora observable en la capacidad de John para mantener el control cercano del balón a lo largo de toques consecutivos, apoyado por instrucciones consistentes y un ritmo calmado por parte de Rodrigo."
          },
          "pub-buddy-narrator": {
            "name": "El Colega del Bar",
            "description": "Relato ultra informal y bromista, como un amigo contando la noche entre copas.",
            "sample": "Tío, era una tarde de domingo, en ese campito minúsculo junto al mar en el norte, y te juro que el viento estaba jugando de defensa contra John. Rodrigo estaba allí todo serio, en plan seleccionador nacional, deja el balón en el césped y dice: \"Venga, toques cortos. Pie ligero\".\n\nJohn se acerca... le da un toque... y el balón sale disparado inmediatamente. DISPARADO. Como si tuviera billete solo de ida directo a la playa. El chaval mira a Rodrigo en plan \"Oye, esto está roto\", y Rodrigo simplemente dice \"Qué va, campeón. Otra vez\".\n\nAsí que va otra vez. Y otra vez. Y en algún momento John empieza a pillar esos toques limpitos, cabeza arriba y todo, y yo pensando: \"Vale, ya está. Lo siguiente es que fiche por el Oporto\". Rodrigo solo se ríe, medio orgulloso, medio intentando disimular. Clásico hermano mayor."
          },
          "classic-novelist": {
            "name": "El Novelista Clásico",
            "description": "Narrador equilibrado e inmersivo que muestra en lugar de contar, encaja en la mayoría de historias.",
            "sample": "En la tarde de domingo, el pequeño campo de fútbol junto al mar parecía un mundo propio, cercado por el viento salado y el susurro distante de las olas. Rodrigo colocó el balón a los pies de John y esperó hasta que los hombros de su hermano se relajaron. \"Mantén la vista arriba\", dijo Rodrigo, no como una orden, sino más bien como un secreto compartido. John asintió, luego intentó un toque suave hacia adelante. El balón rodó un poco demasiado lejos. Frunció el ceño. Rodrigo no se precipitó. Dejó que el error se asentara un segundo, luego se acercó. \"Otra vez\", dijo, y su voz cargaba la paciencia de quien había aprendido la misma lección por las malas. John dio un toque más pequeño esta vez, más firme, y cuando Rodrigo sonrió, la sonrisa de John llegó un latido después, como si hubiera estado esperando permiso."
          },
          "noir-investigator": {
            "name": "El Investigador Noir",
            "description": "Gritty y desconfiado, voz de detective hardboiled que arma el caso en la sombra.",
            "sample": "Tarde de domingo, norte de Portugal. Ese tipo de luz que parece inocente hasta que notas lo que esconde. El océano estaba cerca, respirando sal en el aire como si fuera el dueño del lugar. Rodrigo tenía a John en un pequeño campo junto al agua, enseñándole fútbol como si fuera un negocio limpio. Nunca nada lo es. \"Toque suave\", dijo Rodrigo, tocando el balón hacia adelante. John lo intentó. El balón se le escapó, rodando lejos como si tuviera un sitio mejor donde estar. La mandíbula de John se tensó. Así es como empieza, pensé. Frustración. Duda. La lenta creencia de que no estás hecho para esto. Rodrigo no se burló. No le metió prisa. Solo caminó hasta allí y puso el balón otra vez, mismo sitio, misma calma. \"¿Qué has visto?\", preguntó. John parpadeó. \"El balón\", dijo. La sonrisa de Rodrigo no le llegó a los ojos. \"No es suficiente\", respondió. Las olas seguían hablando de fondo. Como testigos que lo recuerdan todo."
          },
          "whimsical-poet": {
            "name": "El Poeta Soñador",
            "description": "Lírico, romántico y lleno de imágenes, convierte escenas simples en momentos tiernos.",
            "sample": "En una tarde de domingo, cuando el norte de Portugal viste su luz oceánica como una bendición, Rodrigo y el pequeño John pisaron un campo modesto que parecía cosido entre la hierba y el horizonte, y el mar, allí cerca, exhalaba su himno infinito de sal y espuma como si marcara el compás. Rodrigo colocó el balón con una ternura generalmente reservada a las cosas frágiles y, con el movimiento más gentil del pie, lo invitó a rodar, no como un objeto, sino como una promesa. \"Mira arriba\", le dijo a John, y las palabras eran simples, pero abrieron una ventana dentro de la concentración del chico, para que sus ojos se alzaran del suelo hacia el mundo vasto y brillante de viento. John lo intentó, tropezó en su toque, luego lo intentó de nuevo, y de nuevo, cada intento una pequeña marea regresando, cada corrección una caracola puesta en la palma de la mano. Cuando por fin el balón se quedó cerca de él, obediente y vivo, la sonrisa de John llegó como el sol rompiendo una suave nube costera, y el orgullo silencioso de Rodrigo se sintió, por un momento, como el propio océano: vasto, paciente y siempre volviendo."
          },
          "scifi-analyst": {
            "name": "El Analista Sci-Fi",
            "description": "Voz precisa y futurista que trata la vida como un registro de misión con humor seco.",
            "sample": "ENTRADA DE REGISTO // Ciclo Local: Tarde de Domingo\nUbicación: Sector Costero, Norte de Portugal // Campo de Entrenamiento (Micro-Campo)\nObjetivo: Transferencia de Protocolos de Control de Fútbol de la Unidad Rodrigo (Instructor) a la Unidad John (Operador Junior).\n\nEscaneo ambiental: aerosoles salinos sostenidos; vectores de viento variables; fondo auditivo dominado por percusión de olas oceánicas.\n\nProcedimiento iniciado: Rodrigo despliega Esfera-1 (balón de fútbol estándar). Demostración: contacto de baja fuerza, secuencia de regate de corto alcance.\nTRANSCRIPCIÓN DE COMUNICACIONES:\nRodrigo: \"Cabeza arriba. Escaneo primero\".\nJohn: \"¿Así?\"\nRodrigo: \"Toque más pequeño. Mantenlo cerca\".\n\nObservación: John exhibe concentración elevada (tensión en la frente; parpadeo reducido). El intento inicial resulta en evento de separación de Esfera-1 (el balón viaja más allá del radio de control óptimo). Respuesta de frustración detectada; Rodrigo contraataca con protocolo de repetición calmada.\nResultado: Tras múltiples iteraciones, John logra precisión de control y estabilidad de trayectoria mejoradas. Probabilidad de adquisición continua de habilidades (dada la paciencia del Instructor + refuerzo moral junto al mar): 91%."
          },
          "folklore-traditionalist": {
            "name": "El Guardián del Folclore",
            "description": "Voz intemporal, de fábula, que habla con símbolos, presagios y moralejas suaves.",
            "sample": "Y así sucedió, en una tarde de domingo, que el Hermano Mayor Rodrigo llevó al Pequeño, John, al pequeño campo cerca del gran océano del norte. El viento se alzó como testigo, y el mar habló en su lengua infinita. Rodrigo colocó el balón en la hierba y dijo: \"Primero: sé firme. Segundo: mira adelante. Tercero: no temas al error\". John obedeció lo mejor que pudo, pero el balón huyó de él, pues la destreza no llega a quien tiene prisa. El corazón de John se volvió pesado y quiso parar. Pero Rodrigo no le riñó; devolvió el balón a sus pies, una y otra vez, como la marea regresa a la orilla. Por fin, John aprendió a mantener el balón cerca, y el viento amainó, como si estuviera complacido.\n\nAsí enseña la leyenda: la fuerza se enseña con paciencia, y la paciencia se aprende a través del amor."
          }
        }
      },
      "languageOptions": [
        {
          "value": "nl-NL",
          "label": "Holandés (Nederlands)"
        },
        {
          "value": "en-US",
          "label": "Inglés"
        },
        {
          "value": "fr-FR",
          "label": "Francés (Français)"
        },
        {
          "value": "de-DE",
          "label": "Alemán (Deutsch)"
        },
        {
          "value": "it-IT",
          "label": "Italiano (Italiano)"
        },
        {
          "value": "pl-PL",
          "label": "Polaco (Polski)"
        },
        {
          "value": "pt-BR",
          "label": "Portugués (Brasil)"
        },
        {
          "value": "pt-PT",
          "label": "Portugués (Portugal)"
        },
        {
          "value": "es-ES",
          "label": "Español"
        }
      ],
      "chapterCounts": {
        "short": "Corto (3-5 capítulos)",
        "medium": "Medio (6-8 capítulos)",
        "long": "Largo (9-12 capítulos)"
      },
      "plurals": {
        "chapter": "capítulo",
        "chapters": "capítulos"
      },
      "sections": {
        "storyBasics": "Conceptos básicos",
        "styleSetting": "Estilo y escenario",
        "contentDetails": "Detalles del contenido",
        "required": "Obligatorio"
      },
      "previews": {
        "storyOutlineProvided": "Esquema de la historia proporcionado",
        "additionalRequestsProvided": "Peticiones adicionales proporcionadas",
        "customImageInstructions": "Instrucciones personalizadas para las imágenes"
      },
      "modal": {
        "title": "Muestras de estilo gráfico",
        "close": "Cerrar",
        "selected": "Seleccionado",
        "samples": "Muestras",
        "altText": "Muestra de {style}"
      },
      "progress": {
        "stepLabel": "Paso {currentStep} de {totalSteps}"
      },
      "errors": {
        "titleRequired": "El título es obligatorio antes de pasar al siguiente paso.",
        "audienceRequired": "El público objetivo es obligatorio antes de pasar al siguiente paso.",
        "novelStyleRequired": "El estilo de novela es obligatorio antes de pasar al siguiente paso. Abre la sección \"Estilo y escenario\".",
        "graphicStyleRequired": "El estilo gráfico es obligatorio antes de pasar al siguiente paso. Abre la sección \"Estilo y escenario\".",
        "noStoryFound": "No se ha encontrado la historia. Empieza desde el paso 1.",
        "saveFailed": "No se pudieron guardar los detalles de la historia",
        "saveFailedTryAgain": "No se pudieron guardar los detalles de la historia. Inténtalo de nuevo.",
        "loadFailed": "No se pudo cargar la información de la historia. Inténtalo de nuevo."
      },
      "saving": "Guardando...",
      "next": "Siguiente"
    },
    "step5": {
      "heading": "Capítulo 5 - El final",
      "intro": "Elige cómo quieres recibir tu historia. Puedes seleccionar varios formatos para disfrutarla de distintas maneras.",
      "deliveryOptions": "Opciones de entrega",
      "creating": "Creando...",
      "insufficientCredits": "Créditos insuficientes",
      "createStory": "Crear historia",
      "buyMoreCredits": "Comprar más créditos",
      "buyMoreCreditsInfo": "La compra de créditos estará disponible pronto. ¡Estate atento!",
      "close": "Cerrar",
      "loadingStoryData": "Cargando datos de la historia...",
      "readyToGenerate": "¡Listo para generar tu historia!",
      "aboutToStart": "Estamos a punto de empezar a crear tu historia personalizada:",
      "ebookGeneration": "📖 Generación de eBook",
      "cost": "Coste:",
      "yourCredits": "Tus créditos:",
      "credits": "créditos",
      "insufficientCreditsTitle": "💳 Créditos insuficientes",
      "needMoreCredits": "Necesitas {count} créditos más para generar tu historia.",
      "getMoreCredits": "Obtener más créditos",
      "startingGeneration": "Iniciando la generación de la historia...",
      "generateMyStory": "🚀 Generar mi historia",
      "storyDataNotAvailable": "Datos de la historia no disponibles. Inténtalo de nuevo.",
      "stepProgress": "Paso {currentStep} de {totalSteps}",
      "alerts": {
        "failedToFetchStoryData": "No se pudieron obtener los datos de la historia. Inténtalo de nuevo.",
        "failedToFetchUserCredits": "No se pudieron obtener los créditos del usuario. Inténtalo de nuevo.",
        "failedToFetchPricingData": "No se pudieron obtener los datos de precios. Inténtalo de nuevo.",
        "failedToDeductCredits": "No se pudieron descontar los créditos. Inténtalo de nuevo.",
        "dataFetchError": "Error al obtener los datos. Revisa tu conexión e inténtalo de nuevo.",
        "failedToLoadCreditInformation": "No se pudo cargar la información de créditos. Inténtalo de nuevo.",
        "failedToLoadPricingInformation": "No se pudo cargar la información de precios. Inténtalo de nuevo.",
        "insufficientCreditsError": "No tienes suficientes créditos. Compra más para continuar.",
        "failedToCompleteStory": "No se pudo completar la historia. Inténtalo de nuevo."
      }
    }
  }
}
