{
  "Voices": {
    "selectVoice": "Seleccionar voz",
    "names": {
      "alloy": "Alloy",
      "ash": "Ash",
      "ballad": "Ballad",
      "coral": "Coral",
      "echo": "Echo",
      "fable": "Fable",
      "nova": "Nova",
      "onyx": "Onyx",
      "sage": "Sage",
      "shimmer": "Shimmer",
      "verse": "Verse",
      "charon": "Charon",
      "aoede": "Aoede",
      "puck": "Puck",
      "kore": "Kore",
      "fenrir": "Fenrir",
      "orus": "Orus",
      "zephyr": "Zephyr",
      "sulafat": "Sulafat"
    },
    "descriptions": {
      "alloy": "Voz neutra y equilibrada, adecuada para narración general y entrega de información.",
      "ash": "Voz clara y precisa, ideal para instrucciones y explicaciones técnicas.",
      "ballad": "Voz melódica y suave que funciona muy bien para contar historias y contenido narrativo.",
      "coral": "Voz cálida y amigable, perfecta para interfaces conversacionales y atención al cliente.",
      "echo": "Voz resonante y profunda, con gran presencia para anuncios y mensajes formales.",
      "fable": "Voz cálida y envolvente con calidad narrativa, diseñada para narrativas inmersivas.",
      "nova": "Voz brillante y enérgica, ideal para contenidos animados y entregas entusiastas.",
      "onyx": "Voz profunda y autoritaria que transmite solidez y confianza.",
      "sage": "Voz serena y reflexiva, adecuada para contenido pausado y de guía.",
      "shimmer": "Voz brillante y enérgica que añade chispa y dinamismo a tu audio.",
      "verse": "Voz versátil y expresiva que se adapta a una amplia variedad de tonos.",
      "charon": "Una voz masculina informativa y clara, excelente para narración y contenido educativo.",
      "aoede": "Una voz femenina ligera y relajada, perfecta para una narración agradable y tranquila.",
      "puck": "Una voz masculina animada y energética, aportando dinamismo divertido a tus historias.",
      "kore": "Una voz femenina firme y segura, ideal para narración clara y autoritaria.",
      "fenrir": "Una voz masculina emocionante y dinámica, perfecta para relatos llenos de acción.",
      "orus": "Una voz masculina firme y estable, transmitiendo fiabilidad y fuerza en la narración.",
      "zephyr": "Una voz femenina brillante y alegre, añadiendo calidez y positividad a tu audio.",
      "sulafat": "Una voz femenina cálida y acogedora, creando una atmósfera cómoda y agradable."
    }
  }
}
