[
   {
    "id": "sara-a-dentista-de-tubaroes",
    "title": "Sara - A dentista de Tubarões",
    "synopses": "A pequena Sara é convidada a ajudar um tubarão do Oceanário de Lisboa que tem uma grande dor de dentes. Entre tanques gigantes e corredores silenciosos, ela veste uma bata especial, recebe uma escova mágica e aprende a falar a língua dos animais marinhos. Com a ajuda de raias curiosas, peixinhos-palhaço e um polvo trapalhão, a Sara descobre que o medo diminui quando percebemos o que está a acontecer. No fim, o tubarão volta a sorrir e o Oceanário celebra a nova heroína: a dentista de tubarões mais corajosa de Portugal.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["family", "child"],
    "tags": "oceanário,lisboa,mar,tubarões,coragem",
    "style": "pixar"
  },
  {
    "id": "mateus_e_o_leao",
    "title": "Mateus e o Leão",
    "synopses": "Um menino carinhoso de 4 anos, o Mateus, que inicialmente teme animais, encontra e adopta um leão bebé chamado Simba em Lanhela, uma vila rural de Portugal. Leva-o para viver no seu apartamento no Porto, onde têm de esconder o novo amigo dos vizinhos curiosos e aprender regras para que o leão não cause confusão. Quando o Simba começa a crescer, a família percebe que o seu lugar verdadeiro é na natureza. Juntos, embarcam numa viagem até à selva africana para o libertar, numa jornada de amizade, crescimento e coragem que o Mateus nunca mais irá esquecer.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child", "family"],
    "tags": "lanhela,porto,leão,simba,amizade,coragem,família,africa",
    "style": "colored_pencil"
  },
  {
    "id": "zoomarine-golfinho",
    "title": "O Salto do Golfinho Azul",
    "synopses": "A Mariana sonha ser treinadora no Zoomarine. Num dia de calor no Algarve, ela descobre que consegue ouvir os pensamentos dos golfinhos. Juntos, preparam uma acrobacia secreta que vai surpreender toda a plateia no espetáculo final.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child", "teen"],
    "tags": "algarve,verão,golfinhos,sonhos",
    "style": "watercolor"
  },
  {
    "id": "badoca-safari",
    "title": "Safari no Alentejo",
    "synopses": "O Tiago vai ao Badoca Safari Park e, durante o passeio de jipe, a sua imaginação toma conta dele. As girafas transformam-se em dinossauros herbívoros e o Alentejo vira uma selva pré-histórica onde ele é o explorador chefe em busca de um tesouro escondido.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child", "family"],
    "tags": "alentejo,safari,imaginação,dinossauros",
    "style": "colored_pencil"
  },
  {
    "id": "portugal-pequenitos",
    "title": "O Gigante de Coimbra",
    "synopses": "O Lucas visita o Portugal dos Pequenitos em Coimbra e sente-se um verdadeiro gigante. Mas quando anoitece, as casinhas ganham vida e os bonecos pedem a ajuda dele para alcançar a estrela que ficou presa no topo da Torre de Belém em miniatura.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child", "parent"],
    "tags": "coimbra,miniatura,magia,noite",
    "style": "disney_style"
  },
  {
    "id": "magikland-fantasma",
    "title": "A Montanha Russa Fantasma",
    "synopses": "Em Penafiel, na Magikland, a Beatriz e os primos descobrem que a montanha russa antiga tem uma carruagem extra que só aparece à meia-noite. Embarcam numa viagem alucinante que desafia a gravidade e os leva ao mundo da Magia.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child", "friend", "team"],
    "tags": "diversão,penafiel,magia,amigos",
    "style": "cartoon"
  },
  {
    "id": "amor-no-electrico-28",
    "title": "Amor nos Carris",
    "synopses": "Lisboa brilhava sob o sol de agosto quando Teresa e Miguel se conheceram no Elétrico 28. Entre curvas apertadas pela Graça e a descida para Alfama, um sorriso tímido transformou-se em conversa, depois em café, depois em amor. Esta é a história de como um trajeto comum se tornou o início de uma viagem extraordinária a dois, pelas colinas douradas da cidade e pelos caminhos da vida.",
    "locale": "pt-PT",
    "intent": "romance",
    "recipients": ["partner","spouse"],
    "tags": "romance,lisbon,travel,anniversary",
    "style": "watercolor"
  },
  {
    "id": "un-mosaico-de-nosotros",
    "title": "Un mosaico de nosotros",
    "synopses": "Entre los mosaicos de colores del Parc Güell, Laura y Carlos descubrieron que el amor también es un arte. Bajo el dragón de Gaudí y junto a las columnas ondulantes, compartieron sueños y promesas mientras Barcelona se extendía a sus pies. Como las pequeñas piezas de cerámica que crean obras maestras, sus momentos juntos construyeron una historia única. Este libro celebra ese primer día mágico donde dos almas se encontraron en el corazón de Barcelona.",
    "locale": "es-ES",
    "intent": "romance",
    "recipients": ["partner","spouse"],
    "tags": "Barcelona,ParcGuell,anniversary,color",
    "style": "comic_book"
  },
  {
    "id": "banda-desenhada-joao",
    "title": "A Banda Desenhada do João",
    "synopses": "O João adora banda desenhada e sonha em ser super-herói. Mas o que acontece quando descobre que até o Homem-Aranha, a Mulher-Maravilha e o Batman precisam de dormir oito horas por noite? Numa aventura ilustrada como uma verdadeira BD, o João conhece os segredos dos super-heróis: rotinas de sono, pijamas especiais anti-vilões, e o poder mágico de recarregar energias. Afinal, não há superpoder mais importante do que uma boa noite de sono!",
    "locale": "pt-PT",
    "intent": "kids_bedtime",
    "recipients": ["child","teen"],
    "tags": "heróis, dormir, rotina, divertido",
    "style": "comic_book"
  },
  {
    "id": "parfums-maman-fr",
    "title": "Les Parfums de Maman",
    "synopses": "Chloé se souvient de sa maman à travers les parfums qui flottent encore dans la maison : la lavande de son armoire, le pain grillé du petit-déjeuner du dimanche, et ce parfum fleuri qu'elle portait les jours spéciaux. Avec l'aide de son papa et de sa grand-mère Marguerite, Chloé découvre que les odeurs sont des ponts magiques vers les souvenirs. Un livre tendre et réconfortant qui montre comment les petits détails sensoriels gardent vivante la présence de ceux qu'on aime.",
    "locale": "fr-FR",
    "intent": "remembrance",
    "recipients": ["child","parent"],
    "tags": "mère,odeurs,réconfort",
    "style": "hand_drawn"
  },
  {
    "id": "recordar-avo-manuel-porto",
    "title": "Recordar o Avô Manuel",
    "synopses": "O Avô Manuel levava sempre o pequeno Tiago a passear junto ao Douro, onde contava histórias dos barcos rabelos e dos tempos antigos. Agora que o avô já não está, Tiago e a família regressam à margem do rio para recordar. Entre gaivotas, pontes e águas que correm, descobrem que as histórias do Avô Manuel continuam vivas em cada esquina do Porto, em cada pôr do sol sobre o rio, e em cada sorriso partilhado. Um livro sobre saudade, memórias e o amor que atravessa gerações.",
    "locale": "pt-PT",
    "intent": "remembrance",
    "recipients": ["child","parent","family","grandparent"],
    "tags": "remembrance,feelings,memories,grandparent",
    "style": "watercolor"
  },
  {
    "id": "as-cartas-da-avo-rosa-lisboa",
    "title": "As Cartas da Avó Rosa",
    "synopses": "Quando a Avó Rosa partiu, deixou uma caixa especial cheia de cartas escritas à mão, cada uma com uma data diferente. A neta Sofia, acompanhada pela mãe Ana, descobre que as cartas contam histórias da infância da avó em Lisboa, receitas secretas, conselhos de vida e pequenas mensagens de amor. A cada carta aberta, Sofia sente a presença da avó mais perto. Um livro delicado sobre como as palavras escritas preservam memórias e mantêm vivos os laços familiares através do tempo.",
    "locale": "pt-PT",
    "intent": "remembrance",
    "recipients": ["child","parent","family","grandparent"],
    "tags": "remembrance,feelings,memories,letters",
    "style": "minimalist"
  },
  {
    "id": "es-madrid-warner",
    "title": "¡Acción en Parque Warner!",
    "synopses": "La familia García—papá Roberto, mamá Carmen, y los hermanos Alba y Diego—pasan un día inolvidable en Parque Warner Madrid. Entre gritos en la montaña rusa Superman, risas con los Looney Tunes, y batidos compartidos bajo el sol, descubren que la mejor aventura no son solo las atracciones, sino los momentos juntos. Diego supera su miedo en Batman: Arkham Asylum, Alba se fotografía con Piolín, y todos terminan cantando en el espectáculo final. ¡Un recuerdo de acción, superhéroes y diversión familiar!",
    "locale": "es-ES",
    "intent": "family_travels",
    "recipients": ["family","child","teen"],
    "tags": "theme-park,fun,madrid",
    "style": "comic_book"
  },
  {
    "id": "de-berlin-museum",
    "title": "Museumsinsel Entdeckungen",
    "synopses": "Anna und Michael verbringen ein langes Wochenende auf der Museumsinsel in Berlin, wo fünf Weltklasse-Museen Geschichte zum Leben erwecken. Von Nofretetes zeitloser Schönheit im Neuen Museum bis zu den beeindruckenden Säulen des Pergamonmuseums entdecken sie die Schichten europäischer Kultur. Zwischen Kaffee am Spreeufer und philosophischen Gesprächen über Kunst erkennen sie, dass Reisen nicht nur Orte zeigt, sondern auch neue Perspektiven eröffnet. Eine kulturelle Reise für erwachsene Entdecker.",
    "locale": "de-DE",
    "intent": "family_travels",
    "recipients": ["adult","couple","self"],
    "tags": "culture,history,berlin",
    "style": "minimalist"
  },
  {
    "id": "london-museum-day",
    "title": "London Museum Day",
    "synopses": "When the weather turned grey over London, the Harrison family—Mum, Dad, Jack and six-year-old Lily—ducked into the Natural History Museum near South Kensington. What started as a rainy-day rescue became an unforgettable adventure: Lily stood mesmerized beneath the towering Diplodocus skeleton, learned about prehistoric seas, and even touched real fossils in the hands-on gallery. After hours of exploration, they warmed up with steaming hot chocolate at a cozy café, raindrops still dancing on the windows. A celebration of curiosity, family time, and making magic out of an ordinary London weekend.",
    "locale": "en-UK",
    "intent": "family_travels",
    "recipients": ["family","child"],
    "tags": "travel,memories,souvenir,weekend",
    "style": "digital_art"
  },
  {
    "id": "uk-sarah-40",
    "title": "Fabulous at Forty",
    "synopses": "Sarah Thompson never imagined turning forty would feel this good. Her closest friends—Emma, Kate, and Priya—plan a surprise celebration across London: brunch at The Ivy, a private tour of the National Portrait Gallery, and cocktails on a rooftop bar overlooking the Thames. As the city lights sparkle below, Sarah realizes that forty isn't about leaving youth behind—it's about embracing confidence, friendship, and all the adventures still to come. A glamorous tribute to midlife magic and the power of sisterhood.",
    "locale": "en-UK",
    "intent": "milestones_celebrations",
    "recipients": ["adult","friend","self"],
    "tags": "40th-birthday,party,glam",
    "style": "sketch"
  },
  {
    "id": "fr-retraite-pierre",
    "title": "Bonne Retraite, Pierre !",
    "synopses": "Après quarante ans de carrière à Paris, Pierre Dubois range son attaché-case et prend la route vers le sud. Ses collègues—Marie, Laurent, et toute l'équipe—organisent une fête surprise pleine d'anecdotes, de rires et de quelques larmes. Entre les discours émouvants et les cadeaux personnalisés, Pierre réalise que ce n'est pas une fin, mais un nouveau chapitre : des matins tranquilles en Provence, du temps pour peindre, et enfin ce potager dont il rêvait. Un hommage chaleureux à une vie de travail et aux nouveaux horizons qui attendent.",
    "locale": "fr-FR",
    "intent": "milestones_celebrations",
    "recipients": ["adult","colleague","friend"],
    "tags": "retirement,milestone,celebration",
    "style": "watercolor"
  },
  {
    "id": "fr-esprit-rugby",
    "title": "L'Esprit du Rugby",
    "synopses": "Les Toulousains—Antoine, Malik, Chloé et toute l'équipe—vivent une saison inoubliable sur les terrains rouges de Toulouse. Entre les entraînements sous la pluie, les mêlées qui testent leur force, et les essais qui font rugir les supporters, ils découvrent que le rugby est bien plus qu'un sport : c'est une école de courage, de respect et de camaraderie. Quand les moments difficiles arrivent, ils apprennent à se relever ensemble, portés par l'esprit d'équipe. Une célébration vibrante des valeurs du rugby et de l'amitié qui unit les joueurs sur et hors du terrain.",
    "locale": "fr-FR",
    "intent": "sports_teams",
    "recipients": ["team","teen"],
    "tags": "rugby, toulouse, valeurs",
    "style": "sketch"
  },
  {
    "id": "de-berliner-kicker",
    "title": "Die Berliner Kicker",
    "synopses": "Die Berliner Kicker—Max, Emma, Noah und ihre Teamkollegen—haben die ganze Saison auf diesen Moment hingearbeitet: das Pokalfinale im heimischen Stadion. Die Reise dorthin war voller Herausforderungen: verlorene Spiele, die Tränen brachten, verletzter Stolz, der sie stärker machte, und Training in eisiger Kälte. Aber mit Unterstützung ihrer Eltern und ihres Trainers Herr Schmidt lernen sie, dass Erfolg nicht nur in Toren gemessen wird, sondern im Zusammenhalt und der Leidenschaft, die sie auf den Platz bringen. Ein emotionales Fußballabenteuer über Durchhaltevermögen, Teamgeist und den süßen Geschmack des Triumphs.",
    "locale": "de-DE",
    "intent": "sports_teams",
    "recipients": ["team","parent","child"],
    "tags": "fussball, berlin, emotionen",
    "style": "anime"
  },
  {
    "id": "it-ragazze-del-volley",
    "title": "Le Ragazze del Volley",
    "synopses": "Giulia, Martina, Sofia e le altre ragazze della squadra di pallavolo milanese hanno un sogno: vincere il campionato regionale. Ma la strada è piena di ostacoli—battute sbagliate, sconfitte dolorose, e momenti di dubbio. Sotto la guida della loro allenatrice, Coach Elena, imparano che ogni schiacciata vincente nasce da ore di allenamento, ogni punto salvato richiede fiducia reciproca, e ogni vittoria appartiene all'intera squadra. Tra risate negli spogliatoi, abbracci dopo i punti, e lacrime di gioia, scoprono che l'amicizia costruita sul campo è il trofeo più prezioso. Una storia dinamica sull'amicizia femminile e il potere dello sport di unire.",
    "locale": "it-IT",
    "intent": "sports_teams",
    "recipients": ["team","teen","friend"],
    "tags": "pallavolo, milano, amicizia",
    "style": "comic_book"
  },
  {
    "id": "es-nd-01",
    "title": "El Rincón de Calma de Leo",
    "synopses": "Leo es un niño de ocho años que a veces siente que el mundo es demasiado ruidoso, demasiado rápido, o demasiado lleno. Con la ayuda de su maestra, la señora Martínez, descubre su Rincón de Calma en la escuela de Madrid: un espacio especial con cojines suaves, música tranquila y herramientas para regular sus emociones. Leo aprende que está bien necesitar un descanso, y sus compañeros aprenden a respetar el espacio de cada uno. Una historia sobre autorregulación, aceptación y la importancia de tener un lugar seguro.",
    "locale": "es-ES",
    "intent": "neurodiversity",
    "recipients": ["child","class"],
    "tags": "self-regulation,anxiety,school",
    "style": "minimalist"
  },
  {
    "id": "sesta-no-alentejo",
    "title": "Sesta no Alentejo",
    "synopses": "O Bolacha é um rafeiro alentejano que conquistou o título de cão mais preguiçoso do mundo. Enquanto a família Silva tenta levá-lo a passear pelos campos dourados, a explorar as aldeias brancas, ou a nadar no rio, o Bolacha tem apenas um objetivo: encontrar o melhor sítio para a sesta. Debaixo de uma oliveira centenária? Perfeito. À sombra do alpendre? Ainda melhor. Uma história hilariante sobre o ritmo tranquilo da vida no Alentejo, onde até os cães sabem que não há pressa nenhuma.",
    "locale": "pt-PT",
    "intent": "pet_stories",
    "recipients": ["family","adult"],
    "tags": "dog, relaxing, funny, countryside",
    "style": "watercolor"
  },
  {
    "id": "baxter-in-london",
    "title": "Baxter in London",
    "synopses": "Baxter is a cheeky Corgi with big dreams and even bigger ears. When his family, the Wilsons, takes him on a grand London adventure, Baxter is convinced he's royal—after all, Corgis are the Queen's favourite! From chasing pigeons in Trafalgar Square to posing majestically in front of Buckingham Palace, Baxter struts through the city like he owns it. Young Oliver and his sister Charlotte can barely keep up with their four-legged explorer. With plenty of treats, belly rubs, and a few muddy paw prints along the way, Baxter discovers that every dog can feel like royalty with the right family by their side. A delightfully funny tail—er, tale—of canine confidence and London sightseeing.",
    "locale": "en-UK",
    "intent": "pet_stories",
    "recipients": ["child","family"],
    "tags": "dog, london, funny, travel",
    "style": "disney_style"
  },
  {
    "id": "minou-a-paris",
    "title": "Minou à Paris",
    "synopses": "Minou est un chat parisien avec une âme d'aventurier. Chaque nuit, pendant que la petite Lucie dort, il sort par la fenêtre et explore les toits de Paris : les cheminées de Montmartre, les jardins secrets du Marais, et même les gargouilles de Notre-Dame. Il rencontre d'autres chats—Félix le philosophe, Grisette la chanteuse—et ensemble ils dansent sous la lune. Mais chaque matin, Minou rentre toujours avant l'aube pour se blottir contre Lucie. Une aventure onirique à travers la Ville Lumière, vue d'en haut.",
    "locale": "fr-FR",
    "intent": "pet_stories",
    "recipients": ["family","child"],
    "tags": "cat, paris, dreamy, travel",
    "style": "disney_style"
  },
  {
    "id": "bello-im-biergarten",
    "title": "Bello im Biergarten",
    "synopses": "Bello ist ein neugieriger Dackel aus München, der eines sonnigen Nachmittags seine Familie im Biergarten verliert. Was als Panik beginnt, wird zum größten Abenteuer seines Lebens: Er stibitzt Würstchen von Tischen, tanzt mit einer Blaskapelle, und macht Freundschaft mit anderen Hunden unter den Kastanienbäumen. Am Ende findet ihn sein Herrchen Thomas—mit vollem Bauch und einem Siegerlächeln. Eine lustige Geschichte über bayerische Gemütlichkeit und einen Hund, der das Leben in vollen Zügen genießt.",
    "locale": "de-DE",
    "intent": "pet_stories",
    "recipients": ["adult","family"],
    "tags": "dog, munich, funny, culture",
    "style": "cartoon"
  },
  {
    "id": "beatriz-constelacoes-planetario-porto",
    "title": "Beatriz e as Constelações no Planetário do Porto",
    "synopses": "Beatriz tem dez anos e é apaixonada por astronomia—especialmente constelações. Às vezes as mudanças de rotina deixam-na ansiosa, mas a professora Helena criou um calendário visual especial para preparar a visita ao Planetário do Porto. Dia após dia, Beatriz risca os quadradinhos, pesquisa sobre a Ursa Maior e Cassiopeia, e sente-se cada vez mais confiante. Quando chega o grande dia, Beatriz brilha: partilha os seus conhecimentos com a turma e descobre que os seus interesses fortes são um superpoder. Uma história sobre neurodiversidade, rotinas que apoiam, e a beleza de aprender de forma diferente.",
    "locale": "pt-PT",
    "intent": "neurodiversity",
    "recipients": ["child","class"],
    "tags": "neurodiversity,inclusion,routine,strengths",
    "style": "digital_art"
  },
  {
    "id": "il-tesoro-di-orta",
    "title": "Il Tesoro di Orta",
    "synopses": "Luca e Sofia seguono bigliettini piegati come barchette sul lago d’Orta e scoprono una mappa che li guida a un “tesoro” fatto de ricordi di famiglia sull’isola di San Giulio.",
    "locale": "it-IT",
    "intent": "kids_adventures",
    "recipients": ["child","family"],
    "tags": "Orta,barchette,mappa,tesoro,famiglia",
    "style": "watercolor"
  },
  {
    "id": "penguin-wee-waddle-edinburgh-uk-01",
    "title": "Alfie & Isla at the Penguin Wee Waddle",
    "synopses": "In Edinburgh, Alfie and Isla join the reimagined “Wee Waddle,” meeting gentoo, rockhopper, and king penguins as they learn why the parade is now on the birds’ terms—and how caring for wildlife starts with respect. edinburghzoo.org.uk",
    "locale": "en-UK",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "zoo,edinburgh,penguins,gentoo,rockhopper",
    "style": "colored_pencil"
  },
  {
    "id": "mia-felix-eismeer-hagenbeck-de-01",
    "title": "Mia und Felix im Eismeer von Hagenbeck",
    "synopses": "Im Eismeer entdecken Mia und Felix Eisbären, Walrosse und Pinguine aus nächster Nähe und lernen, wie das arktische Lebensraum-Design Einblicke über und unter Wasser ermöglicht—und warum Schutzprojekte so wichtig sind. hamburg-travel.com",
    "locale": "de-DE",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "hagenbeck,eismeer,eisbaer,walross,pinguin",
    "style": "watercolor"
  },
  {
    "id": "lena-jonas-europa-park-de-02",
    "title": "Lena und Jonas im Europa-Park: Blaues Feuer & Silberstern",
    "synopses": "Zwischen Launch und Luftigkeit meistern Lena und Jonas Mutproben auf dem blue fire Megacoaster und dem Silver Star—und entdecken, dass Teamgeist der beste Coaster-Trick ist. Europa-Park Erlebnis-Resort+1",
    "locale": "de-DE",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "europa-park,blue-fire,silver-star,coaster,teamgeist",
    "style": "pixar_style"
  },
  {
    "id": "marco-giulia-acquario-genova-it-01",
    "title": "Marco e Giulia all'Acquario di Genova: Tra Lamantini e Squali",
    "synopses": "Nel più grande acquario d'Europa, Marco e Giulia seguono un percorso tra lamantini, pinguini e squali, scoprendo come la biodiversità del mare unisce meraviglia e responsabilità. acquariodigenova.it",
    "locale": "it-IT",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "acquario-di-genova,lamantini,squali,pinguini,porto-antico",
    "style": "colored_pencil"
  },
  {
    "id": "roma-scienza-al-maxxi",
    "title": "Roma Scienza al MAXXI",
    "synopses": "La classe 3B del Liceo Scientifico Cavour—guidata dalla professoressa Romani e con gli studenti Alessandro, Francesca, Matteo e Giulia—visita il MAXXI di Roma per esplorare l'incrocio tra scienza, architettura contemporanea e creatività. Tra le curve audaci di Zaha Hadid e le installazioni interattive, i ragazzi scoprono come la geometria si trasforma in emozione, come la luce plasma lo spazio, e come l'arte può raccontare formule scientifiche. Alessandro, inizialmente scettico, trova ispirazione per il suo progetto di fisica; Francesca fotografa angoli impossibili; e l'intera classe capisce che la scienza e l'arte parlano la stessa lingua universale. Un'esperienza educativa che illumina menti curiose nella capitale eterna.",
    "locale": "it-IT",
    "intent": "school_projects",
    "recipients": ["class","teen"],
    "tags": "roma, maxxi, architettura, arte",
    "style": "sketch"
  },
  {
    "id": "ciencia-no-planetario-do-porto",
    "title": "Turma 4A no Planetário do Porto",
    "synopses": "A Turma 4A da Escola Básica da Bandeira está em polvorosa: hoje é o dia da visita ao Planetário do Porto! A professora Sofia organizou tudo ao pormenor, e os alunos—o curioso Martim, a sonhadora Leonor, o engraçado Gonçalo, e a estudiosa Carolina—não conseguem conter a excitação. Na viagem de autocarro, cantam canções sobre planetas; à chegada, maravilham-se com o teto estrelado que os transporta para o espaço. Aprendem sobre constelações, veem Júpiter de perto (bem, quase!), e descobrem que o universo é muito maior do que a sua pequena sala de aula. No final, cada criança leva para casa um brilho novo nos olhos e mil perguntas sobre o cosmos. Uma aventura educativa que transforma alunos em pequenos astronautas do conhecimento.",
    "locale": "pt-PT",
    "intent": "school_projects",
    "recipients": ["class","child"],
    "tags": "porto, planetario, astronomia",
    "style": "comic_book"
  },
  {
    "id": "porto-bridges-forever-us",
    "title": "Pelas Pontes do Porto, Para Sempre Nós",
    "synopses": "Diogo e Mariana começaram como dois estudantes tímidos que se cruzavam na Ribeira, sem coragem de falar. Mas o São João mudou tudo: entre martelinhos de plástico, sardinhas assadas e o cheiro a manjerico, finalmente se beijaram sob os foguetes que iluminavam o Douro. Meses de namoro trouxeram passeios pela Ponte D. Luís I—primeiro de mão dada, depois em abraços cada vez mais confiantes, sempre parando a meio para admirar as luzes da cidade refletidas na água escura. Agora, anos depois, Diogo leva Mariana ao Jardim do Morro ao pôr do sol. Com a ponte às suas costas e o rio a testemunhar, ajoelha-se e faz a pergunta que ela sempre soube que viria. Ela diz sim entre lágrimas de alegria, e as gaivotas parecem aplaudir. Esta é a história de como dois namorados inseguros se tornaram cúmplices eternos, unidos pelas pontes de pedra e pelos laços do coração, no coração do Porto.",
    "locale": "pt-PT",
    "intent": "romance",
    "recipients": ["partner","spouse","family","adult"],
    "tags": "romance,proposal,city,Porto,anniversary",
    "style": "hand_drawn"
  },
  {
    "id": "viana-norte-waves-of-us",
    "title": "Ondas do Norte: A Nossa Promessa em Viana",
    "synopses": "Miguel e Sofia são ambos do norte de Portugal, onde o Atlântico é bravio e o vento nunca descansa. Conheceram-se num café em Viana do Castelo, e desde então, os passeios de outono pela praia tornaram-se ritual: caminhar descalços na areia fria, observar o farol solitário, e deixar que o mar levasse as preocupações. Sofia ama o cheiro a maresia; Miguel adora como ela ri quando as ondas lhe molham os pés. Numa tarde dourada de outubro, com o céu pintado de laranja e rosa, Miguel para junto às rochas. Não há anel caro, não há joelho limpo—só areia nos sapatos, sal no ar, e um coração cheio de certeza. \"Queres construir uma vida comigo, com ondas e tudo?\" Sofia responde com um abraço que diz tudo. Ali, entre o farol de Viana e o rugido do norte, dois corações fazem uma promessa simples e verdadeira. Uma história de amor que se mistura com o Atlântico, celebrando compromissos feitos com riso no coração e areia nos sapatos.",
    "locale": "pt-PT",
    "intent": "romance",
    "recipients": ["partner","spouse","family","adult"],
    "tags": "romance,beach,Viana-do-Castelo,engagement,gift",
    "style": "sketch"
  },
  {
    "id": "clube-da-natureza-no-jardim-botanico-do-porto",
    "title": "Clube da Natureza no Jardim Botânico do Porto",
    "synopses": "O Clube da Natureza da Escola de São Lázaro—formado pelos entusiastas Rodrigo, Beatriz, André e Mariana, sob a orientação do professor Nuno—embarca numa expedição de descoberta ao Jardim Botânico do Porto. Armados com lupas, cadernos de campo e curiosidade infinita, exploram a diversidade de plantas de todos os continentes, observam insetos polinizadores em ação, e aprendem como cada organismo desempenha um papel vital no ecossistema. Rodrigo fica fascinado com as plantas carnívoras; Beatriz fotografa borboletas com detalhes científicos; André identifica árvores centenárias; e Mariana descobre sementes exóticas. Entre trilhos verdes e estufas perfumadas, a turma compreende que a biodiversidade não está apenas nos livros—está viva, a respirar, mesmo no coração da cidade. Uma experiência educativa ao ar livre que transforma crianças em jovens cientistas e guardiões da natureza.",
    "locale": "pt-PT",
    "intent": "school_projects",
    "recipients": ["class","child"],
    "tags": "porto, jardim botanico, biodiversidade",
    "style": "watercolor"
  },
  {
    "id": "paris-montmartre-nous-deux",
    "title": "Montmartre, Nous Deux",
    "synopses": "Camille et Louis se sont rencontrés sur les escaliers de Montmartre, elle montant avec un portfolio d'art, lui descendant avec sa guitare. Ce fut le début d'un amour tissé de petits matins dorés, de croissants encore chauds partagés au café du coin, et de musique de rue qui faisait danser les passants. Chaque dimanche, ils revenaient au Sacré-Cœur pour voir Paris s'étendre sous leurs pieds—une ville qui semblait exister uniquement pour eux. Un jour, sous un accordéon qui jouait «La Vie en Rose», Louis s'agenouilla et promit à Camille une vie sans détour, pleine de créativité et d'authenticité. Elle dit oui, les larmes aux yeux et le sourire aux lèvres. Aujourd'hui, ils revisitent ces escaliers—plus vieux, plus sages, mais toujours aussi amoureux. Ce livre célèbre leur parcours romantique dans le cœur artistique de Paris, où l'amour et la bohème ne font qu'un.",
    "locale": "fr-FR",
    "intent": "romance",
    "recipients": ["partner","spouse","family","adult"],
    "tags": "romance,Paris,Montmartre,anniversary,gift",
    "style": "vintage"
  },
  {
    "id": "berlin-spree-tower-yes",
    "title": "Ja an der Spree",
    "synopses": "Anna und Lukas lernten sich im Sommer an der Spree kennen—sie joggte, er skizzierte die Skyline mit dem Fernsehturm im Hintergrund. Ein schüchternes «Hallo» führte zu Kaffee, dann zu Spaziergängen entlang des Flusses, wo sie über Träume, Ängste und die Zukunft sprachen. Monate vergingen, und jede Brücke, jede Uferpromenade wurde Teil ihrer gemeinsamen Geschichte. An einem Abend im Dezember, als Lichterketten die Bäume erleuchteten und die Stadt in Wintermagie getaucht war, blieb Lukas stehen. Mit dem Fernsehturm als stiller Zeuge und der Spree sanft plätschernd im Hintergrund, fragte er spontan: «Willst du für immer mit mir am Ufer entlanggehen?» Anna lachte, weinte, und sagte «Ja»—ein einfaches Wort, das alles bedeutete. Diese Geschichte feiert die Magie unerwarteter Momente und die Liebe, die an den Ufern Berlins wächst, wo moderne Architektur und alte Romantik sich treffen.",
    "locale": "de-DE",
    "intent": "romance",
    "recipients": ["partner","spouse","adult","family"],
    "tags": "romance,Berlin,proposal,city,anniversary",
    "style": "digital_art"
  },
  {
    "id": "aventura-zoo-de-lisboa-pt-02",
    "title": "João e Inês no Jardim Zoológico de Lisboa",
    "synopses": "João e Inês, dois irmãos inseparáveis de oito e dez anos, acordam cedo para a aventura que esperavam há semanas: um dia inteiro no Jardim Zoológico de Lisboa! Acompanhados pelos pais, seguem primeiro as pegadas misteriosas do tigre-de-Sumatra, aprendendo sobre esta espécie ameaçada e como cada um pode ajudar na conservação. Inês fica impressionada com as riscas laranja-fogo; João promete adotar simbolicamente um tigre. Na Baía dos Golfinhos, assistem a uma apresentação emocionante onde os golfinhos saltam, rodam e mostram a inteligência que os torna tão especiais. Os educadores explicam como a proteção da natureza começa com pequenos gestos—reciclar, poupar água, respeitar os animais. No final do dia, quando já pensam que a visita terminou, uma grande surpresa felina os espera: um encontro inesperado com uma cria de leão que os deixa boquiabertos. João e Inês regressam a casa com corações cheios, memórias vivas e um compromisso renovado de cuidar do planeta. Uma aventura que mistura diversão, aprendizagem e amor pelos animais. Jardim Zoológico de Lisboa.",
    "locale": "pt-PT",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "zoo,lisboa,tigres,golfinhos,aventura",
    "style": "pixar_style"
  },
  {
    "id": "lea-hugo-parc-asterix-fr-01",
    "title": "Léa et Hugo à Parc Astérix: Dans l'ombre d'OzIris",
    "synopses": "Léa et Hugo, cousins inséparables de neuf et onze ans, ont attendu toute l'année cette sortie au Parc Astérix avec leurs parents. Armés d'une carte farfelue dessinée par le druide Panoramix (enfin, c'est ce qu'ils croient!), ils se lancent dans une quête gauloise à travers le parc. Leur première épreuve: affronter les vrilles vertigineuses d'OzIris, les montagnes russes suspendues où le courage est testé à chaque looping. Hugo hurle de peur puis d'excitation; Léa lève les bras en criant victoire. Ensuite, direction Tonnerre 2 Zeus, où les nouvelles sensations les projettent dans l'univers des dieux grecs avec une vitesse foudroyante. Entre deux attractions, ils croisent Astérix et Obélix pour des photos hilarantes, goûtent des sangliers en barbe à papa, et découvrent que l'amitié et le courage sont leurs meilleurs boucliers—bien plus puissants que la potion magique! Une aventure épique mêlant frissons, rires gaulois et complicité familiale au cœur du parc le plus déjanté de France. parcasterix.fr",
    "locale": "fr-FR",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "parc-asterix,oziris,tonnerre-2-zeus,gaulois,aventure",
    "style": "disney_style"
  },
  {
    "id": "camille-noe-futuroscope-fr-02",
    "title": "Camille et Noé au Futuroscope: Danse avec les Robots",
    "synopses": "Camille et Noé, frère et sœur passionnés de technologie, ont toujours rêvé de visiter le Futuroscope—ce parc où le futur devient réalité. Accompagnés de leur papa ingénieur et leur maman professeure de danse, ils découvrent un monde où science et spectacle fusionnent. L'expérience phare de leur journée? Apprendre la chorégraphie synchronisée d'un robot géant de neuf mètres de haut! Guidés par un animateur enthousiaste, Camille et Noé tentent de reproduire les mouvements mécaniques, rient de leurs erreurs, et finalement réussissent à danser en harmonie avec la machine. Noé s'émerveille de la précision robotique; Camille comprend que même les robots ont besoin d'âme—et que l'inventivité humaine brille le plus quand on bouge ensemble. Entre projections 4D, simulateurs futuristes et attractions immersives, la famille découvre que la technologie n'est pas froide: elle devient magique quand elle rassemble les gens. Une aventure cinétique au Futuroscope qui prouve que l'avenir est fait de collaboration, de créativité et de quelques pas de danse à neuf mètres de haut. Futuroscope.",
    "locale": "fr-FR",
    "intent": "amusement_parks",
    "recipients": ["child","family"],
    "tags": "futuroscope,robots,danse,technologie,famille",
    "style": "pixar_style"
  },
  {
    "id": "pijama-galo-barcelos",
    "title": "O Pijama do Galo de Barcelos",
    "synopses": "O Galo de Barcelos é famoso pelas suas cores vivas e pelo seu cocorocó matinal que acorda toda a aldeia. Mas a pequena Inês descobre um segredo: até o galo mais colorido e barulhento de Portugal precisa de descansar o bico! Acompanha o Galo numa noite mágica onde ele veste o seu pijama especial, escova os dentes (sim, até galos têm dentes nesta história!), e aprende que dormir bem é o segredo para cantar melhor. Uma aventura portuguesa cheia de humor e tradição para a hora de dormir.",
    "locale": "pt-PT",
    "intent": "kids_bedtime",
    "recipients": ["child"],
    "tags": "tradição, humor, cores, portugal",
    "style": "cartoon"
  }
]