{
  "RevolutPayment": {
    "loading": "Chargement des options de paiement ...",
    "securityNote": "Vos informations de paiement sont sécurisées et cryptées.",
    "encryptionNote": "Protégé par un cryptage SSL 256 bits",
    "errors": {
      "sdkLoadFailed": "Impossible de charger le système de paiement. Veuillez actualiser la page.",
      "initializationFailed": "Échec de l'initialisation du paiement. Veuillez réessayer.",
      "3ds_challenge_failed_manually": "3d Secure Challenge a échoué. Veuillez réessayer ou utiliser un autre mode de paiement.",
      "insufficient_funds": "Fonds insuffisants. Veuillez compléter votre compte ou utiliser une autre carte.",
      "transaction_not_allowed_for_cardholder": "Cette transaction n'est pas autorisée pour votre carte.",
      "high_risk": "Paiement signalé comme risque élevé. Veuillez contacter l'assistance ou utiliser une autre carte.",
      "cardholder_name_missing": "Nom du titulaire de la carte manquante. Veuillez saisir le nom complet exactement comme sur la carte.",
      "unknown_card": "La carte n'a pas pu être reconnue. Veuillez vérifier les détails ou utiliser une autre carte.",
      "customer_challenge_abandoned": "Vous avez abandonné le défi de sécurité. Veuillez réessayer.",
      "customer_challenge_failed": "Le défi de sécurité a échoué. Veuillez réessayer.",
      "customer_name_mismatch": "Le nom sur la carte ne correspond pas à votre compte.",
      "do_not_honour": "L'émetteur a refusé le paiement. Veuillez contacter votre banque ou utiliser une autre carte.",
      "expired_card": "La carte a expiré. Veuillez utiliser une carte valide.",
      "invalid_address": "Adresse de facturation non valide. Veuillez vérifier et réessayer.",
      "invalid_amount": "Montant de paiement non valide. Veuillez actualiser et réessayer.",
      "invalid_card": "Numéro de carte non valide. Veuillez vérifier vos coordonnées.",
      "invalid_email": "Adresse e-mail non valide. Veuillez corriger et réessayer.",
      "invalid_country": "Les paiements de ce pays ne sont pas soutenus.",
      "invalid_cvv": "Code de sécurité non valide. Veuillez vérifier et réessayer.",
      "invalid_expiry": "Date d'expiration non valide. Veuillez corriger et réessayer.",
      "invalid_merchant": "Le commerçant n'est pas valide. Veuillez contacter l'assistance.",
      "invalid_phone": "Numéro de téléphone non valide. Veuillez corriger et réessayer.",
      "invalid_pin": "PIN non valide. Veuillez réessayer.",
      "issuer_not_available": "L'émetteur de cartes n'est pas disponible. Veuillez réessayer plus tard.",
      "pick_up_card": "Carte signalée perdue ou volée. Veuillez contacter votre banque.",
      "rejected_by_customer": "Le paiement a été annulé par le titulaire de la carte.",
      "restricted_card": "Cette carte est limitée et ne peut pas être utilisée.",
      "technical_error": "Une erreur technique s'est produite. Veuillez réessayer plus tard.",
      "withdrawal_limit_exceeded": "Limite de retrait de la carte dépassée.",
      "issuer_decline": "L'émetteur de cartes a refusé le paiement.",
      "suspected_fraud": "Le paiement a diminué en raison d'une fraude présumée.",
      "lost_card": "Carte signalée perdue. Veuillez utiliser une autre carte.",
      "stolen_card": "Carte signalée volée. Veuillez utiliser une autre carte.",
      "security_violation": "Le paiement a diminué en raison d'une violation de la sécurité.",
      "law_violation": "Le paiement a diminué en raison des restrictions réglementaires.",
      "transaction_not_allowed": "Cette transaction n'est pas autorisée.",
      "authentication_required": "Authentification requise. Veuillez effectuer une vérification supplémentaire.",
      "invalid_account": "Compte non valide. Veuillez vérifier auprès de votre banque.",
      "invalid_transaction": "Transaction non valide. Veuillez réessayer.",
      "no_such_issuer": "L'émetteur de cartes n'existe pas.",
      "currency_not_supported": "Devise non prise en charge pour cette carte.",
      "new_card_not_unblocked": "Une nouvelle carte n'est pas encore débloquée. Veuillez contacter votre banque.",
      "withdrawal_frequency_exceeded": "La fréquence de retrait dépassée.",
      "pin_try_exceeded": "Trop de tentatives de broches incorrectes.",
      "pin_required": "PIN nécessaire pour terminer la transaction.",
      "customer_verification_failed": "La vérification du client a échoué.",
      "card_not_enrolled_to_three_ds": "Carte non inscrite en 3D sécurisée.",
      "no_common_supported_three_ds_version": "Version sécurisée 3D non prise en charge.",
      "payment_attempt_blocked": "Tentative de paiement bloqué pour des raisons de sécurité.",
      "unknown": "Erreur inconnue. Veuillez réessayer."
    }
  }
}
