{
  "StorySteps": {
    "step1": {
      "unauthenticated": {
        "title": "Ops! Parece que estás a tentar entrar no lounge dos autores!",
        "description": "Embora apreciemos o teu entusiasmo pela narração, tens de iniciar sessão primeiro. Não te preocupes, é mais fácil do que convencer um dragão a partilhar o seu tesouro! 🐉",
        "signIn": "🔐 Iniciar Sessão para Começar a Aventura",
        "signUp": "✨ Criar Conta de Autor",
        "note": "Depois de iniciares sessão, estarás pronto para criar histórias mágicas que fariam inveja ao próprio Merlin! 🧙‍♂️"
      },
      "heading": "Capítulo 1 - O Autor",
      "intro": "Bem-vindo, contador de histórias! Antes de mergulharmos na tua aventura mágica, vamos garantir que temos a tua informação correta. Isto ajuda-nos a personalizar a tua experiência e a manter-te atualizado sobre o progresso da tua história.",      "fields": {
        "fullName": "Nome Completo *",
        "fullNameHelp": "É assim que serás creditado como autor",
        "email": "Endereço de Email *",
        "emailHelp": "Usaremos isto para atualizações importantes sobre a tua história",
        "mobile": "Telemóvel",
        "mobileHelp": "Para notificações urgentes ou atualizações de entrega (opcional)",
        "dedication": "Mensagem de Dedicatória",
        "dedicationPlaceholder": "Escreve uma mensagem de dedicatória personalizada para a primeira página do teu livro...",
        "dedicationHelp": "Esta mensagem aparecerá na primeira página da tua história",
        "optional": "Opcional"
      },
      "messages": {
        "loadingProfile": "A carregar o teu perfil de autor...",
        "required": "Por favor, preenche todos os campos obrigatórios",
        "saveFailed": "Falha ao guardar o perfil. Tenta novamente.",
        "fetchFailed": "Falha ao obter dados do utilizador",
        "loadFailed": "Falha ao carregar a informação do utilizador. Tenta novamente."
      }
    },    "step2": {
      "heading": "Capítulo 2 - A História",
      "intro": "Podes criar a tua história desenhando-a, gravando-a ou simplesmente escrevendo-a.",
      "storyLanguageLabel": "Idioma da História",
      "storyLanguageHelp": "Escolhe o idioma para a tua história",
      "tellYourStoryLabel": "Conta a tua história...",
      "textPlaceholder": "Era uma vez... Deixa a tua imaginação voar! Partilha a tua aventura, os teus sonhos ou qualquer história que seja especial para ti.",
      "textHelp": "Escreve tanto ou tão pouco quanto quiseres. Podes sempre editar isto mais tarde!",
      "tabWrite": "Escrever",
      "tabImage": "Imagem",
      "tabRecord": "Gravar",
      "takePhoto": "Tirar Foto",
      "uploadImage": "Carregar Imagem",
      "recordVoice": "Gravar a tua voz",
      "uploadAudio": "Carregar Ficheiro de Áudio",
      "imageHelp": "Desenha a tua história, tira-lhe uma foto ou carrega uma imagem existente que a represente.",
      "audioHelp": "Grava a tua história diretamente ou carrega um ficheiro de áudio. Perfeito para quem prefere contar as suas histórias!",
      "recordingHelp": "Conta a tua história! Fala claramente para o microfone.",      "reassurance": "Se escreveste texto ou carregaste uma imagem acima, a nossa IA irá extrair automaticamente personagens, cenários e temas. Caso contrário, os próximos passos vão guiar-te na criação da tua história passo a passo.",
      "processing": "A processar com IA...",
      "nextChapter": "Próximo Capítulo",
      "next": "Seguinte",      "loadingModal": {
        "title": "✨ A Criar a Tua História",
        "message": "Os nossos Oompa Loompas mágicos estão a trabalhar arduamente para preparar a tua história! Isto pode demorar um momento...",
        "pleaseWait": "Por favor aguarda enquanto fazemos a nossa magia! ✨"
      }
    },    "step3": {
      "heading": "Capítulo 3 - As Personagens",
      "intro": "Quem são os heróis, amigos e criaturas mágicas da tua história? Cria personagens que darão vida à tua aventura!",
      "addCharacter": "➕ Adicionar Personagem",
      "chooseMethod": "Escolhe como adicionar uma personagem:",
      "createNew": "✨ Criar Nova Personagem",
      "useExisting": "📚 Usar Personagem Existente",
      "orChooseExisting": "Ou escolhe das tuas personagens existentes:",
      "cancel": "Cancelar",
      "loadingCharacters": "A carregar as tuas personagens...",
      "readyTitle": "Preparado para conhecer as tuas personagens?",
      "readyDescription": "Toda a grande história precisa de personagens incríveis! Clica em \"Adicionar Personagem\" para criar novos heróis ou adicionar personagens existentes da tua biblioteca a esta história.",
      "greatWork": "Bom trabalho! Criaste {count, plural, =1 {# personagem} other {# personagens}}.",
      "youCanAlways": "Podes sempre adicionar mais personagens mais tarde ou avançar para o próximo capítulo para desenvolver ainda mais a tua história.",
      "continuing": "A continuar...",
      "nextChapter": "Próximo Capítulo"
    },
    "step4": {
      "heading": "Capítulo 4 - O Enredo",
      "intro": "Vamos agora definir os elementos centrais da tua história. Fala-nos do mundo que queres criar, para quem escreves e como imaginas a aparência da tua história.",
      "fields": {
        "title": "Título do Livro *",
        "titleHelp": "Escolhe um título cativante para a tua história",
        "place": "Cenário/Local",
        "placeHelp": "Onde decorre a tua história? (real ou imaginário)",
        "audience": "Público-Alvo",
        "audienceHelp": "Para quem é escrita esta história?",
        "novelStyle": "Estilo do Romance",
        "novelStyleHelp": "Que género/estilo deve ter a tua história?",        "graphicStyle": "Estilo Gráfico",
        "graphicStyleHelp": "Escolhe o estilo artístico das ilustrações da tua história",
        "bookSize": "Tamanho do Livro",
        "bookSizeHelp": "Número de capítulos/parágrafos na tua história",
        "outline": "Esboço da História",
        "outlineHelp": "Descreve o enredo, as personagens e os acontecimentos principais da tua história",
        "additional": "Pedidos Adicionais",
        "additionalHelp": "Algum pedido especial ou elementos específicos que queiras incluir"
      },
      "saving": "A guardar...",
      "nextChapter": "Próximo Capítulo"
    },
    "step5": {
      "heading": "Capítulo 5 - O Presente",
      "intro": "Escolhe como gostarias de receber a tua história. Podes selecionar vários formatos de entrega para desfrutares dela de diferentes maneiras.",
      "deliveryOptions": "Opções de Entrega",
      "creating": "A criar...",
      "insufficientCredits": "Créditos Insuficientes",
      "createStory": "Criar história",
      "buyMoreCredits": "Comprar Mais Créditos",
      "buyMoreCreditsInfo": "A funcionalidade de compra de créditos chegará em breve! Fica atento às novidades.",
      "close": "Fechar"
    }
  }
}
