{
  "Voices": {
    "selectVoice": "Selecionar Voz",
    "names": {
      "alloy": "Alloy",
      "ash": "Ash",
      "ballad": "Ballad",
      "coral": "Coral",
      "echo": "Echo",
      "fable": "Fable",
      "nova": "Nova",
      "onyx": "Onyx",
      "sage": "Sage",
      "shimmer": "Shimmer",
      "verse": "Verse",
      "charon": "Charon",
      "aoede": "Aoede",
      "puck": "Puck",
      "kore": "Kore",
      "fenrir": "Fenrir",
      "orus": "Orus",
      "zephyr": "Zephyr",
      "sulafat": "Sulafat"
    },
    "descriptions": {
      "alloy": "Uma voz neutra e equilibrada adequada para narração geral e entrega de informação.",
      "ash": "Uma voz clara e precisa, ideal para instruções e explicações técnicas.",
      "ballad": "Uma voz melódica e suave que se presta bem à narração de histórias e a conteúdo narrativo.",
      "coral": "Uma voz calorosa e amigável, perfeita para interfaces conversacionais e diálogo com clientes.",
      "echo": "Uma voz ressonante e profunda, oferecendo uma forte presença para anúncios e mensagens formais.",
      "fable": "Uma voz calorosa e envolvente com qualidade narrativa, desenhada para narrativas imersivas.",
      "nova": "Uma voz brilhante e energética, ótima para conteúdo animado e entregas entusiasmadas.",
      "onyx": "Uma voz profunda e autoritária que transmite gravitas e confiabilidade.",
      "sage": "Uma voz calma e ponderada, bem adequada para conteúdo reflexivo e orientação.",
      "shimmer": "Uma voz brilhante e energética, adicionando brilho e dinamismo ao seu áudio.",
      "verse": "Uma voz versátil e expressiva que se adapta bem a uma ampla gama de requisitos tonais.",
      "charon": "Uma voz masculina informativa e clara, excelente para narração e conteúdo educativo.",
      "aoede": "Uma voz feminina leve e descontraída, perfeita para uma narração agradável e tranquila.",
      "puck": "Uma voz masculina animada e energética, trazendo dinamismo divertido às suas histórias.",
      "kore": "Uma voz feminina firme e confiante, ideal para narração clara e autoritária.",
      "fenrir": "Uma voz masculina excitante e dinâmica, perfeita para contos cheios de ação e envolventes.",
      "orus": "Uma voz masculina firme e estável, transmitindo fiabilidade e força na narração.",
      "zephyr": "Uma voz feminina brilhante e alegre, adicionando calor e positividade ao seu áudio.",
      "sulafat": "Uma voz feminina calorosa e acolhedora, criando uma atmosfera confortável e agradável."
    }
  }
}
